In [1]:
import numpy as np
import pandas as pd

In [3]:
# Đọc file ratings.csv => đưa dữ liệu vào ratings
ratings = pd.read_csv('ratings.csv', sep=',', parse_dates=['timestamp'])
# Cho biết kiểu dữ liệu (type) của ratings
print(type(ratings))
# Cho biết kích thước của ratings
print(ratings.shape)
# Hiển thị 5 dòng đầu tiên (head) của ratings
ratings.head()

<class 'pandas.core.frame.DataFrame'>
(100004, 4)

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

In [4]:
# Cho biết trong ratings có dữ liệu null hay không?
ratings.isnull().any()

userId       False
movieId      False
rating       False
timestamp    False
dtype: bool

In [5]:
ratings.isnull().sum()

userId       0
movieId      0
rating       0
timestamp    0
dtype: int64

In [6]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100004 entries, 0 to 100003
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100004 non-null  int64
 1   movieId    100004 non-null  int64
 2   rating     100004 non-null  float64
 3   timestamp  100004 non-null  object
dtypes: float64(1), int64(2), object(1)
memory usage: 3.1+ MB

In [7]:
# Tạo cột parsed_time trong tags bằng cách đổi thời gian sang định dạng DateTime 
ratings['parsed_time'] = pd.to_datetime(ratings['timestamp'], unit='s')
# Cho biết kiểu dữ liệu của cột parsed_time
ratings['parsed_time'].dtype

dtype('<M8[ns]')

In [8]:
ratings['timestamp'].dtype

dtype('O')

In [9]:
ratings.head()

   userId  movieId  rating   timestamp         parsed_time
0       1       31     2.5  1260759144 2009-12-14 02:52:24
1       1     1029     3.0  1260759179 2009-12-14 02:52:59
2       1     1061     3.0  1260759182 2009-12-14 02:53:02
3       1     1129     2.0  1260759185 2009-12-14 02:53:05
4       1     1172     4.0  1260759205 2009-12-14 02:53:25

In [10]:
ratings.tail()

        userId  movieId  rating   timestamp         parsed_time
99999      671     6268     2.5  1065579370 2003-10-08 02:16:10
100000     671     6269     4.0  1065149201 2003-10-03 02:46:41
100001     671     6365     4.0  1070940363 2003-12-09 03:26:03
100002     671     6385     2.5  1070979663 2003-12-09 14:21:03
100003     671     6565     3.5  1074784724 2004-01-22 15:18:44

In [11]:
ratings[ratings['parsed_time'] > '2014-12-31'].sort_values(by='parsed_time', ascending=True).head(10)

       userId  movieId  rating   timestamp         parsed_time
80719     547   111622     4.0  1420131595 2015-01-01 16:59:55
95046     624   105954     3.0  1420150263 2015-01-01 22:11:03
95051     624   106491     2.0  1420388390 2015-01-04 16:19:50
95081     624   109853     2.0  1420392949 2015-01-04 17:35:49
80765     547   120821     4.5  1420455375 2015-01-05 10:56:15
52186     380   112623     2.5  1420491929 2015-01-05 21:05:29
47740     352      318     5.0  1420521083 2015-01-06 05:11:23
47747     352     1193     3.5  1420521110 2015-01-06 05:11:50
47743     352      593     4.0  1420521113 2015-01-06 05:11:53
47751     352     1213     2.5  1420521115 2015-01-06 05:11:55

In [12]:
ratings['year'] = pd.DatetimeIndex(ratings['parsed_time']).year

In [14]:
ratings.head()

   userId  movieId  rating   timestamp         parsed_time  year
0       1       31     2.5  1260759144 2009-12-14 02:52:24  2009
1       1     1029     3.0  1260759179 2009-12-14 02:52:59  2009
2       1     1061     3.0  1260759182 2009-12-14 02:53:02  2009
3       1     1129     2.0  1260759185 2009-12-14 02:53:05  2009
4       1     1172     4.0  1260759205 2009-12-14 02:53:25  2009

In [15]:
ratings.tail()

        userId  movieId  rating   timestamp         parsed_time  year
99999      671     6268     2.5  1065579370 2003-10-08 02:16:10  2003
100000     671     6269     4.0  1065149201 2003-10-03 02:46:41  2003
100001     671     6365     4.0  1070940363 2003-12-09 03:26:03  2003
100002     671     6385     2.5  1070979663 2003-12-09 14:21:03  2003
100003     671     6565     3.5  1074784724 2004-01-22 15:18:44  2004

In [16]:
ratings.groupby('year').size()

year
1995        3
1996     6239
1997     3294
1998     1825
1999     5901
2000    13869
2001     4658
2002     3938
2003     4462
2004     4658
2005     7161
2006     7493
2007     1548
2008     3676
2009     3434
2010     2518
2011     4450
2012     3849
2013     1969
2014     2224
2015     6610
2016     6225
dtype: int64

In [17]:
ratings['year'].value_counts()

2000    13869
2006     7493
2005     7161
2015     6610
1996     6239
2016     6225
1999     5901
2004     4658
2001     4658
2003     4462
2011     4450
2002     3938
2012     3849
2008     3676
2009     3434
1997     3294
2010     2518
2014     2224
2013     1969
1998     1825
2007     1548
1995        3
Name: year, dtype: int64